kafka/gce/bench-results.bak/direct/2016-07-06.02-40/producers/client-1.log
2016:07:06 00:40:33,5122 records sent, 1024.0 records/sec (1.00 MB/sec), 1.3 ms avg latency, 241.0 max latency.
2016:07:06 00:40:38,5126 records sent, 1025.2 records/sec (1.00 MB/sec), 0.7 ms avg latency, 8.0 max latency.
2016:07:06 00:40:43,5123 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 14.0 max latency.
2016:07:06 00:40:48,5122 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:40:53,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 15.0 max latency.
2016:07:06 00:40:58,5122 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 13.0 max latency.
2016:07:06 00:41:03,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.7 ms avg latency, 32.0 max latency.
2016:07:06 00:41:08,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 12.0 max latency.
2016:07:06 00:41:13,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 9.0 max latency.
2016:07:06 00:41:18,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 22.0 max latency.
2016:07:06 00:41:23,5125 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 9.0 max latency.
2016:07:06 00:41:28,5124 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 10.0 max latency.
2016:07:06 00:41:34,5123 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 19.0 max latency.
2016:07:06 00:41:39,5123 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 10.0 max latency.
2016:07:06 00:41:44,5125 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 13.0 max latency.
2016:07:06 00:41:49,5122 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 7.0 max latency.
2016:07:06 00:41:54,5125 records sent, 1024.8 records/sec (1.00 MB/sec), 0.6 ms avg latency, 18.0 max latency.
2016:07:06 00:41:59,5122 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:42:04,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 1.1 ms avg latency, 67.0 max latency.
2016:07:06 00:42:09,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:42:14,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 21.0 max latency.
2016:07:06 00:42:19,5123 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 26.0 max latency.
2016:07:06 00:42:24,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 9.0 max latency.
2016:07:06 00:42:29,5128 records sent, 1025.4 records/sec (1.00 MB/sec), 0.7 ms avg latency, 21.0 max latency.
2016:07:06 00:42:34,5123 records sent, 1024.4 records/sec (1.00 MB/sec), 0.5 ms avg latency, 9.0 max latency.
2016:07:06 00:42:39,5125 records sent, 1024.4 records/sec (1.00 MB/sec), 0.5 ms avg latency, 10.0 max latency.
2016:07:06 00:42:44,5126 records sent, 1025.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 7.0 max latency.
2016:07:06 00:42:49,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:42:54,5125 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:42:59,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:43:04,5124 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:43:09,5122 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 10.0 max latency.
2016:07:06 00:43:14,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.6 ms avg latency, 9.0 max latency.
2016:07:06 00:43:19,5123 records sent, 1024.6 records/sec (1.00 MB/sec), 0.5 ms avg latency, 7.0 max latency.
2016:07:06 00:43:24,5122 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:43:29,5122 records sent, 1024.2 records/sec (1.00 MB/sec), 0.5 ms avg latency, 8.0 max latency.
2016:07:06 00:43:34,5121 records sent, 1024.2 records/sec (1.00 MB/sec), 1.0 ms avg latency, 65.0 max latency.
2016:07:06 00:43:39,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 9.0 max latency.
2016:07:06 00:43:44,5124 records sent, 1024.4 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:43:49,5129 records sent, 1025.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 6.0 max latency.
2016:07:06 00:43:54,5123 records sent, 1024.2 records/sec (1.00 MB/sec), 0.6 ms avg latency, 8.0 max latency.
2016:07:06 00:43:58,215040 records sent, 1023.946365 records/sec (1.00 MB/sec), 0.62 ms avg latency, 241.00 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 16 ms 99.9th.